
&НаСервере
Процедура КартинкаНажатиеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	НачатьПомещениеФайла( 
		Новый ОписаниеОповещения("ПослеПомещенияКартинки", ЭтотОбъект)
		, , 
		, Истина
		, УникальныйИдентификатор
	);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияКартинки(Результат, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	Картинка = Адрес; 
	Модифицированность = Истина; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		Картинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Изображение");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(Картинка)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(Картинка); 
		ТекущийОбъект.Изображение = Новый ХранилищеЗначения(ФайлКартинки); 
		УдалитьИзВременногоХранилища(Картинка); 
		Картинка = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Изображение"); 
	КонецЕсли;
КонецПроцедуры


